/usr/local/mysql
./bin/mysqld启动MySQL
mysqld_safe是一个启动脚本，他会间接调用MySQL。而且还顺便启动了另一个监控进程，这个监控进程在服务器进程挂了的时候，可以帮助重启它。另外，使用mySQLd_safe启动服务器程序时，它会将服务器程序的出错信息和其他诊断信息重定向到某个文件中，产出错误日志，这样可以方便我们找出发生错误的原因。
mysql.server也是一个启动脚本，它会间接的调用mysqld_safe
使用方法:启动mysql.server start关闭mysql.server stop
mysqld_multi可以启动或停止监控（对多个MySQL）
mysql -h主机名  -u用户名 -p密码
mysql原始端口3306 
如果想要自定义端口：mysqld -P端口号
指定端口启动mysql -h127.0.0.1 -uroot -P3307 -p
客户端->处理连接->查询缓存->语法解析->查询优化->存储引擎（innodb）->文件系统
explain查询执行计划
查看当前服务器支持的存储引擎show engines

innodb记录结构
1.将表中数据存储到盘上的存储引擎
2.将内存划分为若干个页，以页作为磁盘和内存之间交互的基本单位，innodb中页大小一般为16kb.

我们可以在创建或修改表的语句中指定行格式：

CREATE TABLE 表名 (列的信息) ROW_FORMAT=行格式名称
    
ALTER TABLE 表名 ROW_FORMAT=行格式名称

innodb的四中行格式
compact:额外信息+真实记录
额外信息：变长字段长度列表（按照长度顺序逆序存放），null值列表，记录头信息
真实信息：列1的值。。。。列n的值。

变长字段长度列表
存储一个字符需要字节w
假设变长字节最多能存m个字节
那么最大占用字节数就是m*w
假设实际占用字节数是l
当m*w<=255用一个字节表示字符串占据的字节数
当m*w>255
分两中情况
1.l<=127,则用1个字节来表示真正字符串占用的字节数
  l>127,则用2个字节来表示真正字符串占用的字节数

null值列表
1.先统计表中那些列允许存储null
2.允许存储null的列对应一个二进制位，二进制位按照列的顺序逆序排序
为0代表该列值为null为1不为null
3.null值列表必须用整数个字节的位表示，不是则在高位补0

记录头信息
1.由固定5个字节组成（也就是40个二进制位）

innodb生成主键的策略：优先使用客户自定义的主键作为主键，没定义选取一个unique键作为主键，如果这都没有添加一个row_id的隐藏列作为主键。



